export const herbRules = `

=========================
中药饮片视觉鉴定规则
=========================

【白术】

颜色特征：
外表皮灰黄色或灰棕色
切面黄白色至淡黄色

形态特征：
不规则厚片

切面结构：
散生棕黄色点状油室
木部有放射状纹理
烘干品可呈角质样
可见裂隙

纹理特征：
外表皮有瘤状突起
断续纵皱和沟纹

粉性特征：
质地坚实
无明显粉性

关键识别点：
点状油室
放射状纹理
角质样切面

易混淆药材：
苍术

排除规则：
无棕黄色油室时降低白术概率

--------------------------------

【山药】

颜色特征：
表面类白色或淡黄白色
切面类白色

形态特征：
类圆形
椭圆形
不规则厚片

切面结构：
切面类白色
散生淡棕色筋脉点
多数蠕虫状空隙
近皮部可见淡黄棕色环

纹理特征：
切面细腻

粉性特征：
富粉性

关键识别点：
高粉性
筋脉点
蠕虫状空隙

易混淆药材：
木薯片
番薯加工品

排除规则：
无粉性时降低山药概率
断面光滑且无蠕虫状空隙时排除山药

--------------------------------

【茯苓】

颜色特征：
白色
淡红色
淡棕色

形态特征：
块片状
大小不一

切面结构：
断面粗糙
颗粒性明显

纹理特征：
表面较平整
无明显放射纹

粉性特征：
粉性强

关键识别点：
颗粒性断面
均匀色泽
块片结构

易混淆药材：
淀粉压制品
木薯制品

排除规则：
断面平坦光滑时降低茯苓概率
出现明显形成层环时排除茯苓

--------------------------------

【黄芪】

颜色特征：
外表皮淡棕黄色或淡棕褐色
皮部黄白色
木部淡黄色

形态特征：
类圆形或椭圆形厚片

切面结构：
放射状纹理明显
裂隙明显
呈菊花心结构

纹理特征：
纵皱纹
纵沟明显

粉性特征：
纤维性较强
兼具粉性

关键识别点：
金盏银盘
菊花心
放射纹

易混淆药材：
苦参

排除规则：
无菊花心结构时降低黄芪概率

--------------------------------

【党参】

颜色特征：
外表皮灰黄色至灰棕色
木部淡黄色

形态特征：
类圆形厚片

切面结构：
断面较平坦
可见裂隙
可见放射状纹理

纹理特征：
根头有疣状突起可见狮子盘头
根头下有环状横纹

粉性特征：
无明显粉性

关键识别点：
狮子盘头
环状横纹

易混淆药材：
防风

排除规则：
无狮子盘头时排除党参

--------------------------------

【甘草】

颜色特征：
外表皮红棕色或灰棕色
切面中心黄白色

形态特征：
类圆形或椭圆形厚片

切面结构：
形成层环明显
放射状纹理明显
可见裂隙

纹理特征：
纵皱纹
沟纹
皮孔明显

粉性特征：
略显粉性

关键识别点：
红棕色
形成层环
放射纹
菊花心

易混淆药材：
苦参

排除规则：
无形成层环时降低甘草概率
无放射纹菊花心时降低甘草概率

--------------------------------

【麦冬】

颜色特征：
表面淡黄色或灰黄色
断面黄白色

形态特征：
纺锤形
两端略尖
长度一般在 1.5～3厘米之间，直径约为 0.3～0.6厘米

切面结构：
断面半透明
中柱细小

纹理特征：
细纵纹明显

粉性特征：
无明显粉性

关键识别点：
不超过3厘米的纺锤形
半透明
细小中柱

易混淆药材：
山麦冬

排除规则：
断面不透明时降低麦冬概率
中柱粗大时排除麦冬

--------------------------------

【知母】

颜色特征：
外表皮黄棕色或棕色
切面黄白色至黄色

形态特征：
不规则类圆形厚片

切面结构：
放射状纹理明显
裂隙明显
部分可见同心环纹

纹理特征：
外皮可见叶基纤维残留
点状根痕

粉性特征：
具粉性

关键识别点：
头部浅黄色茎叶残基
放射状纹理
裂隙
粉性

易混淆药材：
鸢尾（根茎呈不规则结节状，扁长条形，断面淡黄白色）

排除规则：
无放射状纹理者排除知母
发现明显油室时排除知母


--------------------------------

【桔梗】

颜色特征：
表面白色或淡黄色
皮部淡黄色

形态特征：
椭圆形或不规则厚片

切面结构：
裂隙较多
形成层环明显
中央黄色圆心明显
木部放射纹明显

纹理特征：
木部宽大

粉性特征：
无明显粉性

关键识别点：
裂隙
棕色形成层环
中央黄色圆心

易混淆药材：
南沙参

排除规则：
无裂隙时降低桔梗概率
无形成层环时降低桔梗概率

--------------------------------

【当归】

颜色特征：
外表皮浅棕色至棕褐色
切面浅棕黄色或黄白色

形态特征：
类圆形
椭圆形
不规则薄片

切面结构：
形成层环明显
大量棕色油点
皮部厚
木部颜色较浅
可见裂隙

纹理特征：
纵皱纹
横长皮孔样突起

粉性特征：
无明显粉性

关键识别点：
棕色形成层环
油点
皮部厚

易混淆药材：
独活

排除规则：
无油点时降低当归概率
形成层环不明显时降低当归概率

--------------------------------

【川芎】

颜色特征：
外表皮灰褐色或黄褐色
切面黄白色或灰黄色

形态特征：
不规则厚片
可呈蝴蝶片

切面结构：
切面光滑
散在黄棕色油室
波状环纹明显
多角形纹理明显

纹理特征：
表皮粗糙皱缩
深缺刻明显

粉性特征：
无明显粉性

关键识别点：
蝴蝶片
波状环纹
油室

易混淆药材：
藁本

排除规则：
无波状环纹时降低川芎概率
无油室时降低川芎概率

--------------------------------

【黄芩】

颜色特征：
外表皮黄棕色或棕褐色
切面黄棕色或黄绿色

形态特征：
类圆形或不规则薄片

切面结构：
放射状纹理明显
老根中心常呈棕褐色
部分可见中空结构
栽培品可略呈角质样

纹理特征：
纵皱纹
网状纹明显

粉性特征：
无明显粉性

关键识别点：
放射状纹理
枯朽中心
角质样断面

易混淆药材：
滇黄芩

排除规则：
无放射状纹理时降低黄芩概率
切面灰暗且结构模糊时降低黄芩概率

`;