export const herbRules = `

=========================
根类饮片鉴定规则
=========================

【白术】

来源：
菊科白术根茎

颜色：

外表灰黄色
切面黄白色

形态：

不规则厚片
圆片或块片

纹理：

明显粉性
质地致密

切面结构：

可见棕黄色油点

可见放射状纹理

特征关键词：

油点
粉性
致密

易混淆：

知母
苍术

排除规则：

若出现明显角质样半透明结构

排除白术

--------------------------------

【知母】

来源：

百合科知母根茎

颜色：

黄白色至淡黄色

形态：

长条片
片状较大

纹理：

角质样
半透明感明显

切面结构：

可见放射裂纹

纤维性弱

粉性不明显

特征关键词：

角质
半透明
放射裂纹

易混淆：

白术

排除规则：

若切面油点明显

排除知母

若粉性极强

排除知母

--------------------------------

【黄芪】

颜色：

淡黄色

形态：

圆片

切面结构：

明显形成层环

放射纹清晰

粉性质地

纤维束明显

特征关键词：

形成层环
放射纹
纤维束

易混淆：

甘草

排除规则：

若菊花心明显

排除黄芪

--------------------------------

【甘草】

颜色：

黄白色

形态：

圆片

切面结构：

明显菊花心

放射纹从中心发散

形成层环不明显

特征关键词：

菊花心
放射纹

易混淆：

黄芪

排除规则：

若形成层环清晰完整

排除甘草

--------------------------------

【党参】

颜色：

黄白色

形态：

长片
斜片

切面结构：

裂隙明显

中心疏松

可见裂纹

纹理：

纤维性较弱

特征关键词：

疏松
裂隙
裂纹

易混淆：

麦冬

排除规则：

若半透明角质感明显

排除党参

--------------------------------

【麦冬】

颜色：

淡黄白色

形态：

纺锤状切片

纹理：

角质样

半透明

切面结构：

中心较致密

无明显裂隙

特征关键词：

角质
半透明
致密

易混淆：

党参

排除规则：

若中心裂隙明显

排除麦冬

--------------------------------

【茯苓】

颜色：

纯白色

形态：

方块
丁块

纹理：

颗粒状

断面：

均匀白色

无放射纹

无形成层环

特征关键词：

纯白
均匀

排除规则：

出现形成层环

排除茯苓

--------------------------------

【山药】

颜色：

白色

形态：

圆片

纹理：

粉性极强

切面：

细腻均匀

放射纹极弱

特征关键词：

高粉性

细腻

排除规则：

出现油点

排除山药

--------------------------------

【当归】

颜色：

黄棕色

纹理：

油润

香气型根片

切面结构：

明显菊花纹

棕色油点

油室明显

特征关键词：

菊花纹

油点

油润

排除规则：

完全干白无油润感

排除当归

`;